URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "Y-lvGDlD3zpDDdpvJPbQmQ"], ["LIMIT", 1]]
---
    def self.random_code
        loop do
            random_code = SecureRandom.urlsafe_base64(16)
            return random_code unless ShortenedUrl.exists?(short_url: random_code)

INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "kaAJ6Q0l4I4TxlWduiJtLQ"], ["long_url", "winnie.com/signup"], ["user_id", 1], ["created_at", "2020-10-27 00:41:39.179535"], ["updated_at", "2020-10-27 00:41:39.179535"]]
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "9LROaKWCkY--1QE2TFDv_Q"], ["long_url", "adfa"], ["user_id", 1], ["created_at", "2020-10-27 01:27:21.082207"], ["updated_at", "2020-10-27 01:27:21.082207"]]
---
    def self.create_for_user_and_long_url!(user, long_url)
        ShortenedUrl.create!(
            user_id: user.id,
            long_url: long_url,
            short_url: ShortenedUrl.random_code
        )

SELECT "shortened_urls".* FROM "shortened_urls" WHERE (created_at >= '2020-10-27 01:26:21.072225') AND "shortened_urls"."user_id" = $1  [["user_id", 1]]
---
    def no_spamming
        last_minute_urls = ShortenedUrl
            .where('created_at >= ?', 1.minute.ago)
            .where(user_id: user_id)
            .length